<?php 
//用户在线支付
$array['u_online'] = array('ICBC' => '中国工商银行','ABC' => '中国农业银行','CCB' => '中国建设银行','BOC'=>'中国银行','CMB' => '招商银行','CITIC' => '中信银行','CMBC'=>'民生银行','GDB' => '广东发展银行','CIB' => '中国兴业银行','CEB' => '光大银行','COMM'=>'交通银行','SPDB'=>'浦东发展银行','BCCB' => '北京银行','PSBC' => '中国邮政','CBHB'=>'渤海银行','NJCB'=>'南京银行','CZB'=>'浙商银行','SZPAB'=>'平安银行','TESTBANK'=>'测试银行');

//企业在线支付
$array['c_online'] = array('BOC'=>'中国银行','ABC' => '中国农业银行','CCB' => '中国建设银行','ICBC' => '中国工商银行','CEB' => '光大银行','TESTBANK'=>'测试银行');

//邦卡支付
$array['q_pay'] = array('BOC'=>'中国银行','ABC' => '中国农业银行','CCB' => '中国建设银行','ICBC' => '中国工商银行','CMB' => '招商银行','CITIC' => '中信银行','CIB' => '中国兴业银行','CEB' => '光大银行','BOS'=>'上海银行','HXB'=>'华夏银行','CMBC'=>'民生银行','SPDB'=>'浦东发展银行','SZPAB'=>'平安银行');

//邦卡支付提示
$array['q_pay_info'] = array(
'BOC'=>'首次最大充值10000/单笔最大充值10000/日限额10000',
'ABC' => '首次最大充值50000/单笔最大充值50000/日限额10万',
'CCB' => '首次最大充值50000/单笔最大充值50000/日限额100万',
'ICBC' => '首次最大充值50000/单笔最大充值50000/日限额5万',
'CMB' => '首次最大充值500/单笔最大充值50000/日限额100万',
'CITIC' => '首次最大充值50000/单笔最大充值50000/日限额100万',
'CIB' => '首次最大充值50000/单笔最大充值50000/日限额5万',
'CEB' => '首次最大充值50000/单笔最大充值50000/日限额100万',
'BOS'=>'首次最大充值5000/单笔最大充值5000/日限额5万',
'HXB'=>'首次最大充值500/单笔最大充值500/日限额2000',
'CMBC'=>'首次最大充值500/单笔最大充值50000/日限额100万',
'SPDB'=>'首次最大充值500/单笔最大充值500/日限额1万',
'SZPAB' => '首次最大充值50000/单笔最大充值50000/日限额100万'
)
;

return $array;
//return array('ICBC' => '中国工商银行','ABC' => '中国农业银行','CMB' => '招商银行','COMM'=>'交通银行','GDB' => '广东发展银行','CCB' => '中国建设银行','CIB' => '中国兴业银行','BCCB' => '北京银行','PSBC' => '中国邮政','CITIC' => '中信银行','CEB' => '光大银行','GNXS'=>'广州市农信社','GZCB'=>'广州市商业银行','BJRCB'=>'北京农商行','HCCB'=>'杭州银行','BOC'=>'中国银行','HKBCHINA'=>'汉口银行','BOS'=>'上海银行','HSBANK'=>'徽商银行','CBHB'=>'渤海银行','HXB'=>'华夏银行','CCQTGB'=>'重庆三峡银行','NBCB'=>'宁波银行','CEB'=>'光大银行','NJCB'=>'南京银行','SHRCB'=>'上海农村商业银行','SNXS'=>'深圳农村商业银行','CMBC'=>'民生银行','SXJS'=>'晋城市商业银行','CSCB'=>'长沙银行','SZPAB'=>'平安银行','CZB'=>'浙商银行','UPOP'=>'银联在线支付','CZCB'=>'浙江稠州商业银行','WZCB'=>'温州市商业银行','SPDB'=>'浦东发展银行','TESTBANK'=>'测试银行');
?>